// Задача 7 Выяснить является ли число чётным

Console.WriteLine("Введите целое число: ");

int a = Convert.ToInt32(Console.ReadLine());

if(a % 2 == 0){
    Console.WriteLine("Число четное.");
}
else{ Console.WriteLine("Число нечетное.");}