// Задача 6 Написать программу вычисления значения функции y = sin(a). (Класс Math)
Console.WriteLine("Введите число а: ");
double a = Convert.ToDouble(Console.ReadLine());
double y = Math.Sin(a);
Console.WriteLine(y);
