// Задача 1 С клавиатуры вводится целое число. Вывести квадрат числа

Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(a * a);

